html/avoiding-burnout.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Avoiding burnout: lessons learned from a 19th century philosopher</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">Avoiding burnout: lessons learned from a 19th century philosopher</h1>
<p>
<a href="https://codewithoutrules.com/2018/09/27/avoiding-burnout/">https://codewithoutrules.com/2018/09/27/avoiding-burnout/</a>
</p>

<p>
文中很多词汇都不太懂。大致有这么几点：
</p>

<p>
不要将焦点放在如何获得快乐这个目的上，而更应该关注过程和你关心的事情上。
</p>
<blockquote>
<p>
Mill’s first conclusion was that happiness is a side-effect, not a goal you can achieve directly, nor verify directly by rational self-interrogation. Whenever you ask yourself “can I prove that I’m happy?” the self-consciousness involved will make the answer be “no”. Instead of choosing happiness as your goal, you need to focus on some other thing you care about:
</p>

<p>
It’s worth noticing that Mill is suggesting focusing on something you actually care about. If you’re spending your time working on something that meaningless to you, you will probably have a harder time of it.
</p>
</blockquote>

<p>
做事情之前不能计较太多或者说过分思考。过分思考可以制定严密的计划，但是却也容易产生恐惧降低兴趣。
</p>
<blockquote>
<p>
On the one hand, rational logical thought is immensely useful in understanding the world: “it enables us mentally to separate ideas which have only casually clung together”. But this ability to analyze also has its costs, since “the habit of analysis has a tendency to wear away the feelings”. In particular, analysis “fearfully undermine all desires, and all pleasures”.
</p>

<p>
Why should this make you happy? You try to analyze it logically, and eventually conclude there is no reason it should—and now you’re no longer happy.
</p>
</blockquote>

<p>
通过自然和艺术来培养和提升你的感受力。
</p>
<blockquote>
<p>
Mill’s second conclusion was that logical thought and analysis are not enough on their own. He still believed in the value of “intellectual culture”, but he also aimed to become a more balanced person by “the cultivation of the feelings”. And in particular, he learned the value of “poetry and art as instruments of human culture”.
</p>

<p>
Both nature and art cultivate the feelings, an additional and distinct way of being human beyond logical analysis:
</p>
</blockquote>

<p>
总结下来就是:
</p>
<ul class="org-ul">
<li>Aim in your work not for happiness, but for a goal you care about: improving the world, or even just applying and honing a skill you value.
</li>
<li>Your work—and the rational thought it entails—will not suffice to make you happy; rational thought on its own will undermine your feelings.
</li>
<li>You should therefore also cultivate your feelings: through nature, and through art.
</li>
</ul>
</div>
</body>
</html>
